e474/UnoCart-Develop/source/STM32firmware/AtariCart/src/main.c
/*
 * --------------------------------------
 * UNOCart Firmware (c)2016 Robin Edwards
 * --------------------------------------
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#define _GNU_SOURCE

#include "defines.h"
#include "stm32f4xx.h"
#include "tm_stm32f4_fatfs.h"
#include "tm_stm32f4_delay.h"
#include <stdio.h>
#include <string.h>

#include "ace8bit.h"

#include "flash.h"

#include "rom.h" /* unsigned char cart_rom[64*1024] */
#include "osrom.h"

unsigned char cart_ram1[64*1024];
unsigned char cart_ram2[64*1024] __attribute__((section(".ccmram")));
unsigned char cart_d5xx[256] = {0};
char errorBuf[40];

int ace_file = 0;
uint32_t ace_file_entry_point;

static const unsigned char MagicNumber[] = "ACE-8BIT";


#define CART_CMD_OPEN_ITEM			0x00
#define CART_CMD_READ_CUR_DIR		0x01
#define CART_CMD_GET_DIR_ENTRY		0x02
#define CART_CMD_UP_DIR				0x03
#define CART_CMD_ROOT_DIR			0x04
#define CART_CMD_SEARCH				0x05
#define CART_CMD_LOAD_SOFT_OS		0x10
#define CART_CMD_SOFT_OS_CHUNK		0x11
#define CART_CMD_MOUNT_ATR			0x20	// unused, done automatically by firmware
#define CART_CMD_READ_ATR_SECTOR	0x21
#define CART_CMD_WRITE_ATR_SECTOR	0x22
#define CART_CMD_ATR_HEADER			0x23
#define CART_CMD_NO_CART			0xFE
#define CART_CMD_ACTIVATE_CART  	0xFF

#define CART_TYPE_NONE				0
#define CART_TYPE_8K				1	// 8k
#define CART_TYPE_16K				2	// 16k
#define CART_TYPE_XEGS_32K			3	// 32k
#define CART_TYPE_XEGS_64K			4	// 64k
#define CART_TYPE_XEGS_128K			5	// 128k
#define CART_TYPE_SW_XEGS_32K		6	// 32k
#define CART_TYPE_SW_XEGS_64K		7	// 64k
#define CART_TYPE_SW_XEGS_128K		8	// 128k
#define CART_TYPE_MEGACART_16K		9	// 16k
#define CART_TYPE_MEGACART_32K		10	// 32k
#define CART_TYPE_MEGACART_64K		11	// 64k
#define CART_TYPE_MEGACART_128K		12	// 128k
#define CART_TYPE_BOUNTY_BOB		13	// 40k
#define CART_TYPE_ATARIMAX_1MBIT	14	// 128k
#define CART_TYPE_WILLIAMS_64K		15	// 32k/64k
#define CART_TYPE_OSS_16K_TYPE_B	16	// 16k
#define CART_TYPE_OSS_8K			17	// 8k
#define CART_TYPE_OSS_16K_034M		18	// 16k
#define CART_TYPE_OSS_16K_043M		19	// 16k
#define CART_TYPE_SIC_128K			20	// 128k
#define CART_TYPE_SDX_64K			21	// 64k
#define CART_TYPE_SDX_128K			22	// 128k
#define CART_TYPE_DIAMOND_64K		23	// 64k
#define CART_TYPE_EXPRESS_64K		24	// 64k
#define CART_TYPE_BLIZZARD_16K		25	// 16k
#define CART_TYPE_ACE				253 // ARM Cartridge Executable
#define CART_TYPE_ATR				254
#define CART_TYPE_XEX				255

typedef struct {
	char isDir;
	char filename[13];
	char long_filename[32];
	char full_path[210];
} DIR_ENTRY;	// 256 bytes = 256 entries in 64k

int num_dir_entries = 0; // how many entries in the current directory

int entry_compare(const void* p1, const void* p2)
{
	DIR_ENTRY* e1 = (DIR_ENTRY*)p1;
	DIR_ENTRY* e2 = (DIR_ENTRY*)p2;
	if (e1->isDir && !e2->isDir) return -1;
	else if (!e1->isDir && e2->isDir) return 1;
	else return strcasecmp(e1->long_filename, e2->long_filename);
}

char *get_filename_ext(char *filename) {
    char *dot = strrchr(filename, '.');
    if(!dot || dot == filename) return "";
    return dot + 1;
}

int is_valid_file(char *filename) {
	char *ext = get_filename_ext(filename);
	if (strcasecmp(ext, "CAR") == 0 || strcasecmp(ext, "ROM") == 0
			|| strcasecmp(ext, "ACE") == 0
			|| strcasecmp(ext, "XEX") == 0 || strcasecmp(ext, "ATR") == 0)
		return 1;
	return 0;
}

// single FILINFO structure
FILINFO fno;
char lfn[_MAX_LFN + 1];   /* Buffer to store the LFN */

void init() {
	// this seems to be required for this version of FAT FS
	fno.lfname = lfn;
	fno.lfsize = sizeof lfn;
}

int scan_files(char *path, char *search)
{
    FRESULT res;
    DIR dir;
    UINT i;

	res = f_opendir(&dir, path);
	if (res == FR_OK) {
		for (;;) {
			if (num_dir_entries == 255) break;
			res = f_readdir(&dir, &fno);
			if (res != FR_OK || fno.fname[0] == 0) break;
			if (fno.fattrib & (AM_HID | AM_SYS)) continue;
			if (fno.fattrib & AM_DIR) {
				i = strlen(path);
				strcat(path, "/");
				strcat(path, fno.fname);
				if (strlen(path) >= 210) continue;	// no more room for path in DIR_ENTRY
				res = scan_files(path, search);
				if (res != FR_OK) break;
				path[i] = 0;
			}
			else if (is_valid_file(fno.fname))
			{
				// copy the 8.3 filename to the LFN if blank
				if (!fno.lfname[0]) strcpy(fno.lfname, fno.fname);
				char *match = strcasestr(fno.lfname, search);
				if (match) {
					DIR_ENTRY *dst = (DIR_ENTRY *)&cart_ram1[0];
					dst += num_dir_entries;
					// fill out a record
					dst->isDir = (match == fno.lfname) ? 1 : 0;	// use this for a "score"
					strcpy(dst->filename, fno.fname);
					strncpy(dst->long_filename, fno.lfname, 31);
					dst->long_filename[31] = 0;
					// full path for search results
					strcpy(dst->full_path, path);

					num_dir_entries++;
				}
			}
		}
		f_closedir(&dir);
	}
	return res;
}

int search_directory(char *path, char *search) {
	char pathBuf[256];
	strcpy(pathBuf, path);
	num_dir_entries = 0;
	int i;
	FATFS FatFs;
	TM_DELAY_Init();
	if (f_mount(&FatFs, "", 1) == FR_OK) {
		if (scan_files(pathBuf, search) == FR_OK) {
			// sort by score, name
			qsort((DIR_ENTRY *)&cart_ram1[0], num_dir_entries, sizeof(DIR_ENTRY), entry_compare);
			DIR_ENTRY *dst = (DIR_ENTRY *)&cart_ram1[0];
			// reset the "scores" back to 0
			for (i=0; i<num_dir_entries; i++)
				dst[i].isDir = 0;
			return 1;

		}
	}
	strcpy(errorBuf, "Problem searching SD card");
	return 0;
}

int read_directory(char *path) {
	int ret = 0;
	num_dir_entries = 0;
	DIR_ENTRY *dst = (DIR_ENTRY *)&cart_ram1[0];

	FATFS FatFs;
	TM_DELAY_Init();
	if (f_mount(&FatFs, "", 1) == FR_OK) {
		DIR dir;
		if (f_opendir(&dir, path) == FR_OK) {
			while (num_dir_entries < 255) {
				if (f_readdir(&dir, &fno) != FR_OK || fno.fname[0] == 0)
					break;
				if (fno.fattrib & (AM_HID | AM_SYS))
					continue;
				dst->isDir = fno.fattrib & AM_DIR ? 1 : 0;
				if (!dst->isDir)
					if (!is_valid_file(fno.fname)) continue;  // skip if not valid filename (based on file extension)
				// copy file record to first ram block
	            strcpy(dst->filename, fno.fname);
				if (fno.lfname[0]) {
					strncpy(dst->long_filename, fno.lfname, 31);
					dst->long_filename[31] = 0;
				}
				else strcpy(dst->long_filename, fno.fname);
				dst->full_path[0] = 0; // path only for search results
	            dst++;
				num_dir_entries++;
			}
			f_closedir(&dir);
		}
		else
			strcpy(errorBuf, "Can't read directory");
		f_mount(0, "", 1);
		qsort((DIR_ENTRY *)&cart_ram1[0], num_dir_entries, sizeof(DIR_ENTRY), entry_compare);
		ret = 1;
	}
	else
		strcpy(errorBuf, "Can't read SD card");
	return ret;
}

/* ATR Handling */

// ATR format
#define ATR_HEADER_SIZE 16
#define ATR_SIGNATURE 0x0296
typedef struct {
  uint16_t signature;
  uint16_t pars;
  uint16_t secSize;
  uint16_t parsHigh;
  uint8_t flags;
  uint16_t protInfo;
  uint8_t unused[5];
} ATRHeader;

