e474/UnoCart-Develop/source/STM32firmware/AtariCart/src/main.c
		// default cartridge size, this gets changed to CART_TYPE_NONE in error situations
		cart_type = CART_TYPE_8K;

		// check that the file at least has a valid header

		// file size first, is file big enough to have a header?

		unsigned int image_size;

		image_size = f_size(&fil);

		if (image_size < sizeof(ACEFileHeader)) {
			cart_type = CART_TYPE_NONE;
			strcpy(errorBuf, "ACE file truncated");
			goto closefile;
		}

		// read ACE file into buffer

		// see how much data to read
		// (read in BUFFER_SIZE blocks of data if file is bigger than buffer)
		unsigned int bytes_to_read = image_size > BUFFER_SIZE ? BUFFER_SIZE : image_size;

		UINT bytes_read_from_file;

		// load data from file into cartridge memory
		FRESULT read_result = f_read(&fil, &cart_ram1[0], bytes_to_read, &bytes_read_from_file);

		if (read_result != FR_OK) {
			strcpy(errorBuf, "Can't read from ACE file");
			cart_type = CART_TYPE_NONE;
			goto closefile;
		}

		// Validate header
		ACEFileHeader * header = (ACEFileHeader *)&cart_ram1[0];

		// Check magic number text
		int valid_header_magic_number = ((strncmp((char *) MagicNumber, (char *) header->magic_number, ACE_MAGIC_NUMBER_STRING_LENGTH)) == 0);

		if (!valid_header_magic_number) {
			cart_type = CART_TYPE_NONE;
			strcpy(errorBuf, "Not an 8-Bit ACE file");
			goto closefile;
		}

		// preserve values in header
		uint32_t ace_rom_size = header->rom_size;
		ace_file_entry_point = header->entry_point;

		// check that rom_size is less than maximum rom size (448 KB)
		if (ace_rom_size > ACE_MAX_ROM_SIZE) {
			cart_type = CART_TYPE_NONE;
			strcpy(errorBuf, "ACE ROM size too big");
			goto closefile;
		}

		// file passed all validity tests

		// try to write file buffer contents to FLASH

	    flash_context ctx;

	    int can_prepare_flash = prepare_flash(ace_rom_size, &ctx);

	    if (!can_prepare_flash) {
			strcpy(errorBuf, "Can't start write to Flash");
			cart_type = CART_TYPE_NONE;
			goto closefile;
	    }

	    int write_to_flash_status = write_flash(bytes_to_read, &cart_ram1[0], &ctx);

	    if (!write_to_flash_status) {
			strcpy(errorBuf, "Can't write to Flash");
			cart_type = CART_TYPE_NONE;
			goto closefile;
	    }

	    // data read from file has been written to flash successfully

	    // check to see if all data has now been written to flash
	    if (ace_rom_size <= BUFFER_SIZE) {
	    	// file written to flash, can jump to entry point

			// tidy up

			f_close(&fil);
			f_mount(0, "", 1);


	//		ace_rom_entry_point

			return cart_type;					// this might be the place to jump through ACE vector?

	    }

	    // rest of file needs to be read in and written to flash
	    // (in blocks of BUFFER_SIZE)

	    int bytes_written_to_flash = BUFFER_SIZE;

//	    int image_size_remaining = image_size - bytes_written_to_flash;

	    while (bytes_written_to_flash < ace_rom_size) {

	    	// read next block from file
	    	bytes_to_read = image_size > BUFFER_SIZE ? BUFFER_SIZE : image_size;

			read_result = f_read(&fil, &cart_ram1[0], bytes_to_read, &bytes_read_from_file);

			if (read_result != FR_OK) {
				strcpy(errorBuf, "Can't read from ACE file");
				cart_type = CART_TYPE_NONE;
				goto closefile;

			}

			// write next block to flash

		    write_to_flash_status = write_flash(bytes_to_read, &cart_ram1[0], &ctx);

		    if (!write_to_flash_status) {
				strcpy(errorBuf, "Can't write block to Flash");
				cart_type = CART_TYPE_NONE;
				goto closefile;

		    }
	    	bytes_written_to_flash += bytes_to_read;
//	    	image_size_remaining -= bytes_to_read;    // ?? not uswful?

	    }


		// tidy up

		f_close(&fil);
		f_mount(0, "", 1);

    	// Should never return
    	((void (*)())ace_file_entry_point)();

//		ace_rom_entry_point

		return cart_type;					// this might be the place to jump through ACE vector?

	}

	// set a default error
	strcpy(errorBuf, "Can't read file");

	unsigned char *dst = &cart_ram1[0];
	int bytes_to_read = 64 * 1024;
	if (xex_file) {
		dst += 4;	// leave room for the file length at the start of sram
		bytes_to_read -= 4;
	}
	// read the file in two 64k chunks to each area of SRAM
	if (f_read(&fil, dst, bytes_to_read, &br) != FR_OK) {
		cart_type = CART_TYPE_NONE;
		goto closefile;
	}
	size += br;
	if (br == bytes_to_read) {
		// first 64k was complete, so try to load 64k more
		if (f_read(&fil, &cart_ram2[0], 64*1024, &br) != FR_OK) {
			cart_type = CART_TYPE_NONE;
			goto closefile;
		}
		size += br;
		if (br == 64*1024) {
			// that's 128k read, is there any more?
			if (f_read(&fil, carFileHeader, 1, &br) != FR_OK) {
				cart_type = CART_TYPE_NONE;
				goto closefile;
			}
			if	(br == 1) {
				strcpy(errorBuf, "Cart file/XEX too big (>128k)");
				cart_type = CART_TYPE_NONE;
				goto closefile;
			}
		}
	}

	// set the correct cart type based on the size
	if (car_file) {
		if (size != expectedSize) {
			strcpy(errorBuf, "CAR file is wrong size");
			cart_type = CART_TYPE_NONE;
			goto closefile;
		}
	}
	else if (xex_file) {
		cart_type = CART_TYPE_XEX;
		// stick the size of the file as the first 4 bytes (little endian)
		cart_ram1[0] = size & 0xFF;
		cart_ram1[1] = (size >> 8) & 0xFF;
		cart_ram1[2] = (size >> 16) & 0xFF;
		cart_ram1[3] = 0;	// has to be zero!
	}
	else {	// not a car/xex file - guess the type based on size
		if (size == 8*1024) cart_type = CART_TYPE_8K;
		else if (size == 16*1024) cart_type = CART_TYPE_16K;
		else if (size == 32*1024) cart_type = CART_TYPE_XEGS_32K;
		else if (size == 64*1024) cart_type = CART_TYPE_XEGS_64K;
		else if (size == 128*1024) cart_type = CART_TYPE_XEGS_128K;
		else {
			strcpy(errorBuf, "Unsupported ROM size ");
			cart_type = CART_TYPE_NONE;
			goto closefile;
		}
	}

closefile:
	f_close(&fil);
cleanup:
	f_mount(0, "", 1);
	return cart_type;
}

#define RD5_LOW GPIOB->BSRRH = GPIO_Pin_2;
#define RD4_LOW GPIOB->BSRRH = GPIO_Pin_4;
#define RD5_HIGH GPIOB->BSRRL = GPIO_Pin_2;
#define RD4_HIGH GPIOB->BSRRL = GPIO_Pin_4;

#define CONTROL_IN GPIOC->IDR
#define ADDR_IN GPIOD->IDR
#define DATA_IN GPIOE->IDR
#define DATA_OUT GPIOE->ODR

