e474/UnoCart-Develop/source/STM32firmware/AtariCart/src/main.c
#define PHI2_RD (GPIOC->IDR & 0x0001)
#define S5_RD (GPIOC->IDR & 0x0002)
#define S4_RD (GPIOC->IDR & 0x0004)
#define S4_AND_S5_HIGH (GPIOC->IDR & 0x0006) == 0x6

#define PHI2	0x0001
#define S5		0x0002
#define S4		0x0004
#define CCTL	0x0010
#define RW		0x0020

#define SET_DATA_MODE_IN GPIOE->MODER = 0x00000000;
#define SET_DATA_MODE_OUT GPIOE->MODER = 0x55550000;

#define GREEN_LED_OFF GPIOB->BSRRH = GPIO_Pin_0;
#define RED_LED_OFF GPIOB->BSRRH = GPIO_Pin_1;
#define GREEN_LED_ON GPIOB->BSRRL = GPIO_Pin_0;
#define RED_LED_ON GPIOB->BSRRL = GPIO_Pin_1;

GPIO_InitTypeDef  GPIO_InitStructure;

/* Green LED -> PB0, Red LED -> PB1, RD5 -> PB2, RD4 -> PB4 */
void config_gpio_leds_RD45()
{
	/* GPIOB Periph clock enable */
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
	/* Configure PB0, PB1in output pushpull mode */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_4;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_25MHz;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
}

/* Input Signals GPIO pins on CLK -> PC0, /S5 -> PC1, /S4 ->PC2, CCTL -> PC4, R/W -> PC5 */
void config_gpio_sig(void) {
	/* GPIOC Periph clock enable */
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);

	/* Configure GPIO Settings */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_4 | GPIO_Pin_5;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
}

/* Input/Output data GPIO pins on PE{8..15} */
void config_gpio_data(void) {
	/* GPIOE Periph clock enable */
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);

	/* Configure GPIO Settings */
	GPIO_InitStructure.GPIO_Pin =
		GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_11 |
		GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_25MHz;	// avoid sharp edges
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN;
	GPIO_Init(GPIOE, &GPIO_InitStructure);
}

/* Input Address GPIO pins on PD{0..15} */
void config_gpio_addr(void) {
	/* GPIOD Periph clock enable */
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);

	/* Configure GPIO Settings */
	GPIO_InitStructure.GPIO_Pin =
		GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 |
		GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7 |
		GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_11 |
		GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN;
	GPIO_Init(GPIOD, &GPIO_InitStructure);
}

/*
 Theory of Operation
 -------------------
 Atari sends command to mcu on cart by writing to $D5DF ($D5E0-$D5FF = SDX)
 (extra paramters for the command in $D500-$D5DE)
 Atari must be running from RAM when it sends a command, since the mcu on the cart will
 go away at that point.
 Atari polls $D500 until it reads $11. At this point it knows the mcu is back
 and it is safe to rts back to code in cartridge ROM again.
 Results of the command are in $D501-$D5DF

 This function serves up boot rom/cartridge data from rom.h onto the 8-bit bus, or
 returns the command code written to $D5DF by the 8-bit, for further processing by
 the MCU
*/

int emulate_boot_rom(int atrMode) {
	__disable_irq();	// Disable interrupts
	if (atrMode) RD5_LOW else RD5_HIGH
	RD4_LOW
	cart_d5xx[0x00] = 0x11;	// signal that we are here
	uint16_t addr, data, c;
	while (1)
	{
		// wait for phi2 high
		while (!((c = CONTROL_IN) & PHI2)) ;

		if (!(c & CCTL)) {
			// CCTL low
			if (c & RW) {
				// read
				SET_DATA_MODE_OUT
				addr = ADDR_IN;
				DATA_OUT = ((uint16_t)cart_d5xx[addr&0xFF])<<8;
				// wait for phi2 low
				while (CONTROL_IN & PHI2) ;
				SET_DATA_MODE_IN
			}
			else {
				// write
				addr = ADDR_IN;
				data = DATA_IN;
				// read data bus on falling edge of phi2
				while (CONTROL_IN & PHI2)
					data = DATA_IN;
				cart_d5xx[addr&0xFF] = data>>8;
				if ((addr&0xFF) == 0xDF)	// write to $D5DF, that is, cartridge command sent,
											// so return command to calling code
					break;
			}
		}
		if (!(c & S5)) {
			// normal cartridge read, so serve up data from firmware boot rom image in rom.h
			SET_DATA_MODE_OUT
			addr = ADDR_IN;
			DATA_OUT = ((uint16_t)(UnoCart_rom[addr]))<<8;  /* read from rom.h array */
			// wait for phi2 low
			while (CONTROL_IN & PHI2) ;
			SET_DATA_MODE_IN
		}
	}
	__enable_irq();
	return data>>8;
}

void emulate_standard_8k() {
	// 8k
	RD5_HIGH
	uint16_t addr;
	while (1)
	{
		// wait for s5 low
		while (S5_RD) ;
		SET_DATA_MODE_OUT
		// while s5 low
		while (!S5_RD) {
			addr = ADDR_IN;
			DATA_OUT = ((uint16_t)cart_ram1[addr])<<8;
		}
		SET_DATA_MODE_IN
	}
}

void emulate_standard_16k() {
	// 16k
	RD4_HIGH
	RD5_HIGH
	uint16_t addr;
	while (1)
	{
		// wait for either s4 or s5 low
		while (S4_AND_S5_HIGH) ;
		SET_DATA_MODE_OUT
		if (!S4_RD) {
			// while s4 low
			while (!S4_RD) {
				addr = ADDR_IN;
				DATA_OUT = ((uint16_t)cart_ram1[addr])<<8;
			}
		}
		else {
			// while s5 low
			while (!S5_RD) {
				addr = ADDR_IN;
				DATA_OUT = ((uint16_t)cart_ram1[0x2000|addr])<<8;
			}
		}
		SET_DATA_MODE_IN
	}
}

void emulate_XEGS_32k(char switchable) {
	// 32k
	RD4_HIGH
	RD5_HIGH
	uint16_t addr, data, c;
	unsigned char *bankPtr = &cart_ram1[0];
	while (1)
	{
		// wait for phi2 high
		while (!((c = CONTROL_IN) & PHI2)) ;

		if (!(c & S4)) {
			SET_DATA_MODE_OUT
			addr = ADDR_IN;
			DATA_OUT = ((uint16_t)(*(bankPtr+addr)))<<8;
			// wait for phi2 low
			while (CONTROL_IN & PHI2) ;
			SET_DATA_MODE_IN
		}
		else if (!(c & S5)) {
			SET_DATA_MODE_OUT
			addr = ADDR_IN;
			DATA_OUT = ((uint16_t)cart_ram1[0x6000|addr])<<8;
			// wait for phi2 low
			while (CONTROL_IN & PHI2) ;
			SET_DATA_MODE_IN
		}
		else if (!(c & CCTL) && !(c & RW)) {
			// CCTL low + write
			data = DATA_IN;
			// read the data bus on falling edge of phi2
			while (CONTROL_IN & PHI2)
				data = DATA_IN;
			// new bank is the low 2 bits written to $D5xx
			bankPtr = &cart_ram1[0] + (8192*((data>>8) & 3));
			if (switchable) {
				if (data & 0x8000) {
					RD4_LOW
					RD5_LOW
					GREEN_LED_OFF
				} else {
					RD4_HIGH
					RD5_HIGH
					GREEN_LED_ON
				}
			}
		}
	}
}

void emulate_XEGS_64k(char switchable) {
	// 64k
	RD4_HIGH
	RD5_HIGH
	uint16_t addr, data, c;
	unsigned char *bankPtr = &cart_ram1[0];
	while (1)
	{
		// wait for phi2 high
		while (!((c = CONTROL_IN) & PHI2)) ;

		if (!(c & S4)) {
			SET_DATA_MODE_OUT
			addr = ADDR_IN;
			DATA_OUT = ((uint16_t)(*(bankPtr+addr)))<<8;
			// wait for phi2 low
			while (CONTROL_IN & PHI2) ;
			SET_DATA_MODE_IN
		}
		else if (!(c & S5)) {
			SET_DATA_MODE_OUT
			addr = ADDR_IN;
			DATA_OUT = ((uint16_t)cart_ram1[0xE000|addr])<<8;
			// wait for phi2 low
			while (CONTROL_IN & PHI2) ;
			SET_DATA_MODE_IN
		}
		else if (!(c & CCTL) && !(c & RW)) {
			// CCTL low + write
			data = DATA_IN;
			// read the data bus on falling edge of phi2
			while (CONTROL_IN & PHI2)
				data = DATA_IN;
			// new bank is the low 3 bits written to $D5xx
			bankPtr = &cart_ram1[0] + (8192*((data>>8) & 7));
			if (switchable) {
				if (data & 0x8000) {
					RD4_LOW
					RD5_LOW
					GREEN_LED_OFF
				} else {
					RD4_HIGH
					RD5_HIGH
					GREEN_LED_ON
				}
			}
		}
	}
}

