e474/UnoCart-Develop/source/STM32firmware/AtariCart/src/main.c
	if (cartType == CART_TYPE_8K) emulate_standard_8k();
	else if (cartType == CART_TYPE_16K) emulate_standard_16k();
	else if (cartType == CART_TYPE_XEGS_32K) emulate_XEGS_32k(0);
	else if (cartType == CART_TYPE_XEGS_64K) emulate_XEGS_64k(0);
	else if (cartType == CART_TYPE_XEGS_128K) emulate_XEGS_128k(0);
	else if (cartType == CART_TYPE_SW_XEGS_32K) emulate_XEGS_32k(1);
	else if (cartType == CART_TYPE_SW_XEGS_64K) emulate_XEGS_64k(1);
	else if (cartType == CART_TYPE_SW_XEGS_128K) emulate_XEGS_128k(1);
	else if (cartType == CART_TYPE_BOUNTY_BOB) emulate_bounty_bob();
	else if (cartType == CART_TYPE_ATARIMAX_1MBIT) emulate_atarimax_128k();
	else if (cartType == CART_TYPE_WILLIAMS_64K) emulate_williams();
	else if (cartType == CART_TYPE_OSS_16K_TYPE_B) emulate_OSS_B();
	else if (cartType == CART_TYPE_OSS_8K) emulate_OSS_B();
	else if (cartType == CART_TYPE_OSS_16K_034M) emulate_OSS_A(1);
	else if (cartType == CART_TYPE_OSS_16K_043M) emulate_OSS_A(0);
	else if (cartType == CART_TYPE_MEGACART_16K) emulate_megacart(16);
	else if (cartType == CART_TYPE_MEGACART_32K) emulate_megacart(32);
	else if (cartType == CART_TYPE_MEGACART_64K) emulate_megacart(64);
	else if (cartType == CART_TYPE_MEGACART_128K) emulate_megacart(128);
	else if (cartType == CART_TYPE_SIC_128K) emulate_SIC();
	else if (cartType == CART_TYPE_SDX_64K) emulate_SDX(64);
	else if (cartType == CART_TYPE_SDX_128K) emulate_SDX(128);
	else if (cartType == CART_TYPE_DIAMOND_64K) emulate_diamond_express(0xD0);
	else if (cartType == CART_TYPE_EXPRESS_64K) emulate_diamond_express(0x70);
	else if (cartType == CART_TYPE_BLIZZARD_16K) emulate_blizzard();
	else if (cartType == CART_TYPE_XEX) feed_XEX_loader();
	else
	{	// no cartridge (cartType = 0)
		GREEN_LED_OFF
		RD4_LOW
		RD5_LOW
		while (1) ;
	}
}

int main(void) {

	/* Ouptut: LEDS - PB{0..1}, RD5 - PB2, RD4 - PB4 */
	config_gpio_leds_RD45();
	/* InOut: Data - PE{8..15} */
	config_gpio_data();
	/* In: Address - PD{0..15} */
	config_gpio_addr();
	/* In: Other Cart Input Sigs - PC{0..2, 4..5} */
	config_gpio_sig();

	RED_LED_ON
	int cartType = 0, atrMode = 0;
	char curPath[256] = "";
	char path[256];
	init();

	while (1) {

		/*
		 * loop
		 *  emulate boot rom until Atari sends command by writing command to $D5DF,
		 *  then process that command, and loop back and emulate boot rom until next
		 *  command written to $D5DF
		 */


		GREEN_LED_OFF

		int cmd = emulate_boot_rom(atrMode);

		GREEN_LED_ON

		// OPEN ITEM n
		if (cmd == CART_CMD_OPEN_ITEM)
		{
			int n = cart_d5xx[0x00];
			DIR_ENTRY *entry = (DIR_ENTRY *)&cart_ram1[0];
			if (entry[n].isDir)
			{	// directory
				strcat(curPath, "/");
				strcat(curPath, entry[n].filename);
				cart_d5xx[0x01] = 0; // path changed
			}
			else
			{	// file/search result
				if (entry[n].full_path[0])
					strcpy(path, entry[n].full_path);	// search result
				else
					strcpy(path, curPath); // file in current directory
				strcat(path, "/");
				strcat(path, entry[n].filename);
				if (strcasecmp(get_filename_ext(entry[n].filename), "ATR")==0)
				{	// ATR
					cart_d5xx[0x01] = 3;	// ATR
					cartType = CART_TYPE_ATR;
				}
				else
				{	// ROM,CAR or XEX
					cartType = load_file(path);
					if (cartType)
						cart_d5xx[0x01] = (cartType != CART_TYPE_XEX ? 1 : 2);	// file was loaded
					else
					{
						cart_d5xx[0x01] = 4;	// error
						strcpy((char*)&cart_d5xx[0x02], errorBuf);
					}
				}
			}
		}
		// READ DIR
		else if (cmd == CART_CMD_READ_CUR_DIR)
		{
			int ret = read_directory(curPath);
			if (ret) {
				cart_d5xx[0x01] = 0;	// ok
				cart_d5xx[0x02] = num_dir_entries;
			}
			else
			{
				cart_d5xx[0x01] = 1;	// error
				strcpy((char*)&cart_d5xx[0x02], errorBuf);
			}
		}
		// GET DIR ENTRY n
		else if (cmd == CART_CMD_GET_DIR_ENTRY)
		{
			int n = cart_d5xx[0x00];
			DIR_ENTRY *entry = (DIR_ENTRY *)&cart_ram1[0];
			cart_d5xx[0x01] = entry[n].isDir;
			strcpy((char*)&cart_d5xx[0x02], entry[n].long_filename);
		}
		// UP A DIRECTORY LEVEL
		else if (cmd == CART_CMD_UP_DIR)
		{
			int len = strlen(curPath);
			while (len && curPath[--len] != '/');
			curPath[len] = 0;
		}
		// ROOT DIR (when atari reset pressed)
		else if (cmd == CART_CMD_ROOT_DIR)
			curPath[0] = 0;
		// SEARCH str
		else if (cmd == CART_CMD_SEARCH)
		{
			char searchStr[32];
			strcpy(searchStr, (char*)&cart_d5xx[0x00]);
			int ret = search_directory(curPath, searchStr);
			if (ret) {
				cart_d5xx[0x01] = 0;	// ok
				cart_d5xx[0x02] = num_dir_entries;
			}
			else
			{
				cart_d5xx[0x01] = 1;	// error
				strcpy((char*)&cart_d5xx[0x02], errorBuf);
			}
		}
		else if (cmd == CART_CMD_LOAD_SOFT_OS)
		{
			int ret = load_file("UNO_OS.ROM");
			if (!ret) {
				for (int i=0; i<16384; i++)
					cart_ram1[i] = os_rom[i];
			}
			cart_d5xx[0x01] = 0;	// ok
		}
		else if (cmd == CART_CMD_SOFT_OS_CHUNK)
		{
			int n = cart_d5xx[0x00];
			for (int i=0; i<128; i++)
				cart_d5xx[0x01+i]=cart_ram1[n*128+i];
		}
		else if (cmd == CART_CMD_READ_ATR_SECTOR)
		{
			//uint8_t device = cart_d5xx[0x00];
			uint16_t sector = (cart_d5xx[0x02] << 8) | cart_d5xx[0x01];
			uint8_t offset = cart_d5xx[0x03];	// 0 = first 128 byte "page", 1 = second, etc
			int ret = read_atr_sector(sector, offset, &cart_d5xx[0x02]);
			cart_d5xx[0x01] = ret;
		}
		else if (cmd == CART_CMD_WRITE_ATR_SECTOR)
		{
			//uint8_t device = cart_d5xx[0x00];
			GREEN_LED_OFF
			RED_LED_ON
			uint16_t sector = (cart_d5xx[0x02] << 8) | cart_d5xx[0x01];
			uint8_t offset = cart_d5xx[0x03];	// 0 = first 128 byte "page", 1 = second, etc
			int ret = write_atr_sector(sector, offset, &cart_d5xx[0x04]);
			cart_d5xx[0x01] = ret;
			RED_LED_OFF
		}
		else if (cmd == CART_CMD_ATR_HEADER)
		{
			//uint8_t device = cart_d5xx[0x00];
			if (!&mountedATRs[0].path[0])
				cart_d5xx[0x01] = 1;
			else
			{
				memcpy(&cart_d5xx[0x02], &mountedATRs[0].atrHeader, 16);
				cart_d5xx[0x01] = 0;
			}
		}
		// NO CART
		else if (cmd == CART_CMD_NO_CART)
			cartType = 0;

		// REBOOT TO CART
		else if (cmd == CART_CMD_ACTIVATE_CART)
		{
			if (cartType == CART_TYPE_ATR) {
				atrMode = 1;
				RED_LED_OFF
				int ret = mount_atr(path);
				if (ret == 0)
					memcpy(&cart_d5xx[0x02], &mountedATRs[0].atrHeader, 16);
				cart_d5xx[0x01] = ret;
			}
			else {
				if (ace_file) {
			    	// Should never return
			    	((void (*)())ace_file_entry_point)();
				}
				else {
					emulate_cartridge(cartType);

				}
			}
		}
	}

}
